{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 7], "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 600, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_2"}, {"class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_3"}, {"class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_4"}, {"class_name": "Concatenate", "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_4", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1"}], "name": "model_1", "output_layers": [["concatenate_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}