{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 7], "sparse": false, "name": "input_3"}, "name": "input_3"}, {"class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_9"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 2], "sparse": false, "name": "input_4"}, "name": "input_4"}, {"class_name": "Dense", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 600, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_10"}, {"class_name": "Dense", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 600, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_11"}, {"class_name": "Add", "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_11", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "name": "add_1"}, {"class_name": "Dense", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 600, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_12"}, {"class_name": "Dense", "inbound_nodes": [[["dense_12", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "trainable": true}, "name": "dense_13"}], "name": "model_3", "output_layers": [["dense_13", 0, 0]], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]]}, "backend": "tensorflow"}